Catalogs/ВидыСпорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВидыСпорта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ничья</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Победа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыСпорта/Ext/ManagerModule.bsl
Функция КоличествоОчков(ВидыСпорта)
	Ответ	= Новый Структура("Ничья,Победа", 1, 3);
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВидыСпорта.Ничья КАК Ничья,
	      	               |	ВидыСпорта.Победа КАК Победа
	      	               |ИЗ
	      	               |	Справочник.ВидыСпорта КАК ВидыСпорта
	      	               |ГДЕ
	      	               |	ВидыСпорта.Ссылка = &ВидыСпорта");
	Запрос.УстановитьПараметр("ВидыСпорта",			ВидыСпорта);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Ничья(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Ничья;
КонецФункции

Функция Победа(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Победа;
КонецФункции
